tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/versions"

# brew "coreutils" # http://www.gnu.org/software/coreutils/manual/coreutils.pdf
brew "grep"
brew "openssh"
brew "screen"

brew "zsh"
brew "tldr" # https://github.com/tldr-pages/tldr

brew "calc" # http://www.isthe.com/chongo/tech/comp/calc/

brew "git"
brew "loc"
brew "gource" # software version control visualization http://gource.io

brew "pwgen"
brew "qoomon/tab/ppgen" # passphrase generator; https://github.com/qoomon/passphrase-generator

brew "bat" # cat with highlighing and git support; https://github.com/sharkdp/bat

brew "vim"
brew "micro" # https://github.com/zyedidia/micro
brew "fzf" # https://github.com/junegunn/fzf
# brew "fzy" # https://github.com/jhawthorn/fzy
brew "htop" # better top
brew "nmap"
brew "mtr" # ping and trace combined : http://www.bitwizard.nl/mtr/
brew "tmux" # https://github.com/tmux/tmux
brew "fd" # A simple, fast and user-friendly alternative to 'find'https://github.com/sharkdp/fd
# brew "the_silver_searcher" # command: ag; better find https://github.com/ggreer/the_silver_searcher
brew "irssi" # https://github.com/irssi/irssi
brew "watch" # infinite command loop
brew "watchman" # a file watching service https://facebook.github.io/watchman 

brew "tree"
brew "pstree"
brew "ncdu"

brew "ifstat"
brew "ipcalc"

brew "httpie" # better alternative to curl
brew "httpry" # http sniffer https://github.com/jbittel/httpry
# brew "w3m" # terminal browser

brew "oath-toolkit" # generate OTP Codes e.g. Google Authenticator => oathtool --totp --base32 <Secret>
brew "zbar" # read qr-code images e.g. command: zbarimg qr.png
# brew "tesseract" args: ["with-all-languages"] # ocr https://github.com/tesseract-ocr/tesseract

brew "siege" # benchmark http # https://github.com/JoeDog/siege
brew "vegeta" # benchmark http # https://github.com/tsenart/vegeta
brew "k6" # benchmark http # https://github.com/loadimpact/k6

brew "jq" # json parser

brew "yudai/gotty/gotty"

# brew "dnsmasq" # e.g. wildcard dns server *.localhost \
# && sudo mkdir -p /etc/resolver || sudo tee /etc/resolver/localhost <<< 'nameserver 127.0.0.1' >/dev/null # add dnsmasq as resolver
# brew "socat"

brew "ctop" # htop for docker

brew "node" # js runtime evironment

# cask install java
# brew "jenv"

cask "qlstephen" # quick look for plain text files
cask "qlmarkdown" # quick for markdown files
cask "qlcolorcode" # quick look for src files with syntax highlighting
cask "mark-text" # markdown editor
